{"inkVersion":20,"root":[[{"->":"garden"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"garden":[["^Gardening is the one chore you don't mind as much. Being the daughter of the village's chief means that there is always something more to do.","\n","^The garden is the one place that you feel at peace, like there is no pressure. You begin working in the quiet morning air.","\n","^<i><b>Hiss. Hiss.</i></b>","\n","^What was that sound?","\n","ev","str","^Investigate the sound.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore it. Nothing will ruin this quiet.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You look around the garden uncertainly. You haven't seen a snake in a very long time. Hopefully it was a loose cat instead.","\n",{"->":"snake_encounter"},{"#f":5}],"c-1":["\n","^You bask in the sun, similar to the snake you saw earlier. But now it is time to see Baba.","\n","end",{"#f":5}]}],{"#f":1}],"snake_encounter":[["^Oh my! That's rather long to be a garden snake. You approach it slowly, uncertainly.","\n","^Snakes have been said to be omens of great fortune or terrible misfortune.","\n","ev","str","^It could be harmless. Try to feed it a berry.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Get rid of it with the wooden hoe on the ground.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You hold your palm out for the snake to eat from.","\n",{"->":"snake_friend"},{"#f":5}],"c-1":["\n","^You grab the wicked looking hoe and stab at the snake. It hisses at you, almost offended, before slithering off into the woods behind your house. That was no ordinary snake. Baba should know.","\n","end",{"#f":5}]}],{"#f":1}],"snake_friend":[["^<i>\"Greetingssss to you, young human. Thank you for this ssssmall kindnesssss.","\n","^I have been long wandering for ssssome ssssuch gesture.\"</i>","\n","^Surprised as you are, you manage to dip your head in acknowledgement. Now is not the time to be rude.","\n","^<i>\"Would you have water to spare? I am parched.\"</i>","\n","^[The snake slithers his tongue at you]","\n","ev","str","^Offer to grab the snake a cup from your home.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ","\n","^<i>\"No rush my dear. I don't mind waiting.\"</i>","\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}