{"inkVersion":20,"root":[["^You hurry back to your house, but your father is there, blocking you from entering.","\n","^You note the excited and concerned look on his face.","\n","ev","str","^Ask what is wrong.","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Ignore him. He can always tell you later.","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n","^\"What is wrong, Baba?\"","\n",{"->":"journey_begins"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^\"Don't ignore me child. I have some news that marks coming change for this kingdom.\"","\n","^You stand and wait for your father to continue. He obviously had a point to make.","\n",{"->":"journey_begins"},["done",{"#f":5,"#n":"g-1"}],{"#f":5}]}],"done",{"journey_begins":[["^\"The king's herald just left, child. With him he brought quite the news. The king has decided that he is reaching an age of abdication.","\n","^Since he has no heirs, the king has put out a call for all the beautiful young people in the land to journey to the capital.","\n","^He says he will choose the most beautiful person as his successor!\"","\n","^You are shocked at your father's news. Being queen would bring your family and village honor and prestige, but it would also be a grave responsibility.","\n","ev","str","^Accept the invitation and leave?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Decline the invitation and stay.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^\"Baba, this is too great of an opportunity to pass up. With your blessing, I will go and visit the capital.","\n","^Even if I am not chosen, I can still make great friends for our people.\"","\n","^Your father packs a small bag of essentials for your journey to the capital. You leave, wishing him well in your absence...","\n","end",{"#f":5}],"c-1":["\n","^\"What wonderful news! Thank you for considering me, Baba, but I would rather stay here.","\n","^This village and our people are all I know. I want to stay here and change what I <i>know</i> I can change.","\n",{"->":"the_end.end_2"},{"#f":5}]}],{"#f":1}],"the_end":[{"->":".^.end_1"},{"end_1":["^And so it was that the kingdom rejoiced in the selection of their new queen.","\n","^The people called her Pandora, an ode to her triumph over dark times and her role as the champion of the people's hope.","\n","end",{"#f":1}],"end_2":["^The king ultimately chose a young woman who, while not traditionally beautiful, was beautiful and worthy in her actions.","\n","^She released all who had been held captive by the king and entrusted them with a solemn duty: to go out into the kingdom and teach the value of kindness, compassion, and good.","\n","^You became one of her most ardent supporters, determined to make your next voyage in the world one full of hope and wonder.","\n","^<b> END </b>","\n","end",{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}