{"inkVersion":20,"root":[["^Home, at the beginning of another dull day.","\n",{"->":"home"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"home":[["^You woke up early this morning, like usual. However, there seems to be something in the air, something that spells...change.","\n","^What will you do?","\n","ev","str","^Ignore things and go about your chores as usual.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Walk around the village. Maybe someone knows something?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^The garden is a perfect place to begin your chores. You grab a jug of water and a bowl of berries and take them along with you. Better to eat on the run than not at all.","\n",{"->":"garden"},{"#f":5}],"c-1":["\n","^You head towards the village market, near the center of town.","\n",{"->":"market"},{"#f":5}]}],{"#f":1}],"market":[["^The market is quiet, not surprisingly. Your father insists that you be up early, but the rest of the people in this small village seem to enjoy their sleep.","\n","ev","str","^Head to the garden?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You are bored, but there is one thing that always cheers you up: the garden! You head that way.","\n",{"->":"garden"},"ev","str","^Take a nap","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^No one would notice if you dozed off for a little and then went home...right?","\n",{"->":"news"},{"#f":5}]}],{"#f":1}],"garden":[["^Gardening is the one chore you don't mind as much. Being the daughter of the village's chief means that there is always something more to do.","\n","^The garden is the one place that you feel at peace, like there is no pressure. You begin working in the quiet morning air.","\n","^Hiss. Hiss.","\n","^What was that sound?","\n","ev","str","^Investigate the sound.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore it. Nothing will ruin this quiet.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You look around the garden uncertainly. You haven't seen a snake in a very long time. Hopefully it was a loose cat instead.","\n",{"->":"snake_encounter"},{"#f":5}],"c-1":["\n","^You bask in the sun, similar to the snake you saw earlier. But now it is time to see Baba.","\n",{"->":"news"},{"#f":5}]}],{"#f":1}],"snake_encounter":[["^Oh my! That's rather long to be a garden snake. You approach it slowly, uncertainly.","\n","^Snakes have been said to be omens of great fortune or terrible misfortune.","\n","ev","str","^It could be harmless. Try to feed it a berry.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Get rid of it with the wooden hoe on the ground.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You hold your palm out for the snake to eat from.","\n",{"->":"snake_friend"},{"#f":5}],"c-1":["\n","^You grab the wicked looking hoe and stab at the snake. It hisses at you, almost offended, before slithering off into the woods behind your house. That was no ordinary snake. Baba should know.","\n",{"->":"news"},{"#f":5}]}],{"#f":1}],"snake_friend":[["^\"Greetingssss to you, young human. Thank you for this ssssmall kindnesssss.","\n",["^I have been long wandering for ssssome ssssuch gesture.\"","\n","^Surprised as you are, you manage to dip your head in acknowledgement. Now is not the","\n",["^time to be rude.","\n","^\"Would you have water to spare? I am parched.\"","\n","^[The snake slithers his tongue at you]","\n","ev","str","^Offer to grab the snake a cup from your home.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ","\n",{"->":".^.^.^.^.g-2"},{"#f":5}],"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],{"g-2":["^\"No rush my dear. I don't mind waiting.\"","\n",{"->":"news"},{"#f":5}]}],{"#f":1}],"news":[["^You hurry back to your house, but your father is there, blocking you from entering.","\n","^You note the excited and concerned look on his face.","\n","ev","str","^Ask what is wrong.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore him. He can always tell you later.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^\"What is wrong, Baba?\"","\n",{"->":"journey_begins"},{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Don't ignore me child. I have some news that marks coming change for this kingdom.\"","\n","^You stand and wait for your father to continue. He obviously had a point to make.","\n",{"->":"journey_begins"},{"#f":5}]}],{"#f":1}],"journey_begins":[["^\"The king's herald just left, child. With him he brought quite the news. The king has decided that he is reaching an age of abdication. Since he has no heirs, the king has put out a call for all the beautiful young people in the land to journey to the capital. He says he will choose the most beautiful person as his successor!\"","\n","^You are shocked at your father's news. Being queen would bring your family and village honor and prestige, but it would also be a grave responsibility.","\n","ev","str","^Accept the invitation and leave?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"Baba, this is too great of an opportunity to pass up. With your blessing, I will go and visit the capital. Even if I am not chosen, I can still make great friends for our people.\"","\n",{"->":"first_encounter"},"ev","str","^Decline the invitation and stay.","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":"the_end.end_2"},{"#f":5}],"#f":5}]}],{"#f":1}],"first_encounter":[["^Your father packs a small bag of essentials for your journey to the capital. You leave, wishing him well in your absence. As you leave the village, you encounter a young boy, no more than 9 years old, sitting along the dirt road that leads in and out.","\n","^You greet the boy and note the thirst that tightens his mouth and the way his shirt fits too loosely on his torso.","\n","^\"Please, big sister, do you have any water to spare?\"","\n","ev","str","^Give the boy a drink from the jug and an apple from your bag?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore the boy and keep walking.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You hold out the jug of water so the boy can have his fill.","\n","^\"Here, child. Once you are done, go into the village and look for the chief. Tell him his Pandora has sent you and he will feed and clothe you.\"","\n",{"->":"second_encounter"},{"#f":5}],"c-1":["\n",{"->":"second_encounter"},"^You continue on your way, determined to not be sidetracked again.","\n",{"#f":5}]}],{"#f":1}],"second_encounter":[["^You continue walking the road away from your village. It weaves, winds, and merges into the forest, a canopy of trees beginning to block the view of the sun. You pause upon seeing an elderly woman sitting on a stone on the side of the road.","\n","ev","str","^\"Grandmother, are you well?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You continue walking, turning your head to avoid her gaze.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^\"I am. I am thanking the sun for her generous warmth. Sit with me a moment.\"","\n",["ev","str","^You pause, considering how long it would take to get to the capital. Still, the king probably has many people vying for his attention, so one little stop won't hurt.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You shake your head no","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ","\n","^\"Very well, Grandmother. Please, have something to nourish your body as the sun nourishes your soul\"","\n","^The elderly woman smiles and accepts the sunflower seeds you offer.","\n","^\"Thank you child. As appreciation for your kindness, I will warn you. On the path ahead you will come across a grove of laughing trees. You must not laugh at them, for they will take offense and be of ill-temper.\"","\n","^You nod in appreciation and thank the elderly woman, giving her an extra bag of seeds before continuing on your journey.","\n",{"->":"third_encounter"},{"#f":5}],"c-1":["\n",{"->":"third_encounter"},{"#f":5}]}],{"#f":5}],"c-1":["\n","^\"No time today, Grandmother\"","\n",{"->":"third_encounter"},{"#f":5}]}],{"#f":1}],"third_encounter":[["^\"Hahaha.\" You hear laughter in the distance, hysterical, and growing louder. Here, in a small copse of trees, you see a wondrous sight: The trees seem to have faces and, with them, they are laughing. How beautiful and terrifying.","\n","^You suddenly remembered the warning Grandmother gave you and realize she was quite serious about these laughing trees. But, was her advice also sound?","\n","ev","str","^You decide to respect the trees and their privacy.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Grandmother couldn't be right about everything.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You lower your head to make yourself as inconspicuous as possible and skurry by. Who are you to disturb their joy.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You refuse to be cowed by some odd trees. You laugh, loudly, and stare at the trees defiantly.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^The trees' laughter turns to shrieking, their cries piercing the air. You run as fast as you can to escape them, hands covering your ears.","\n",{"->":"fourth_encounter"},{"#f":5}]}],{"#f":1}],"fourth_encounter":[["^The laughter of the trees is still ringing in your ears, but thankfully you can see that the forest is thinning out. That means you must be quite close to the capital.","\n","^You continue on, becoming more excited and more nervous at the thought that you might actually meet the king. What will he think of you?","\n","^Suddenly, your thoughts are interrupted by a jostle as you've walked into a man who is standing so still in the middle of the road. Before you can ask if he is alright, you notice that this is an odd man! His head is under his shoulder!","\n","ev","str","^Continue on, nonplussed","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yell at the man","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You acknowledge the man's difference and apologize.","\n","^\"I am very sorry sir. I was not paying attention and seem to have walked into you. Do you need help?\"","\n","^\"Indeed I do, young one. I was making my way to the capital. The king is looking for an heir you see!\"","\n",["ev","str","^You smile and offer him your arm","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^You nod and wave goodbye before continuing on","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^\"I do know. I'm on my way there now. Come, let us greet the king together.\"","\n",{"->":"royal_meeting"},{"#f":5}],"c-1":["\n","^\"What an interesting man.\"","\n",{"->":"fifth_encounter"},{"#f":5}]}],{"#f":5}],"c-1":["\n","^\"How rude! You cannot just stand in the middle of the road. You don't get special treatment just for being...different.Go on, out of the way!\"","\n","^You frown at the man and continue on the road towards the capital.","\n",{"->":"fifth_encounter"},{"#f":5}]}],{"#f":1}],"fifth_encounter":["^You have made it to the capital! The capital is somehow smaller than you thought. That could be because of all of the buildings crammed around such a small space.","\n","^You find a garden in the center, a place to take solace for a while.","\n",{"->":"garden_two"},{"#f":1}],"garden_two":[["^You sit and relish in the grounding presence of the garden. You hear a hiss and look around before noticing a snake that seems eerily familiar.","\n","^\"Oh no! I forgot to bring my snake friend his water!\" You look at this snake and frown.","\n","ev","str","^Offer it water","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Get up and head to the castle","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^The snake pokes it tongue out at you, as though in appreciation. You smile, reminded of your own little snake friend.","\n","^You realize the day is drawing to a close. Now would be a good time to try and see the king.","\n",{"->":"royal_meeting"},{"#f":5}],"c-1":["\n","^You back away from the snake, cautiously. It wouldn't do to startle it and greet the king with a massive snake bite. But meet the king you shall!","\n",{"->":"royal_meeting"},{"#f":5}]}],{"#f":1}],"royal_meeting":[["^The castle courtyard is surprisingly empty. The king sent his message all throughout the kingdown so you expected to see many more people here. The air itself was hushed and almost still, as though something was lurking, waiting to expose itself.","\n","^You look around the courtyard and see, at the far end of it, what looks to be a figure in a dark cloak. You draw closer and reach a hand out in front of you.","\n","ev","str","^\"Hello?\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"Show yourself!","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^The cloaked figure removes their hood and you gasp, awed by the royal presence in front of you. The king's eyes are kind, but firm, and you kneel humbly to be in his presence. He chuckles.","\n","^\"There is no need to bow to me. You have demonstrated you are a beautiful soul and worthy to lead this kingdom. Rise, future queen.\"","\n","^You remain kneeling, confused.","\n","^\"But you don't know me, my king. How can you be sure I am worthy?\"","\n","^\"I know your heart. Look at me, child.\"","\n","^You raise your eyes and watch, astonished, as the king shifts to take the form of the boy outside of your village who smiles impishly at you, before shifting to the old woman, his laugh sounding eerily similar to the laughing trees. He winks at you and you watch as his form shrinks to become the man with his head under his arm until finally, he shifts and becomes an extremely familiar sight.","\n","^You see the snake from your garden coiled in front of you, so regal and strong.","\n","^\"You have shown yourself to be a caring and compassionate soul, beautiful because of your kindness and worthy because of your respect for the people of this kingdom and the land it is in. Now, rise queen, and prepare to greet your people\"","\n","^You stand shakily, and rise to your feet. Baba is certainly going to be surprised!","\n",{"->":"the_end.end_1"},{"#f":5}],"c-1":["\n","^You grasp the cloak and yank it off of the mysterious figure and scream in horror. It is a grotesque creature, yet also oddly familiar. The more you stare at it, the more it reminds you of an amalgamation of who you encountered on your journey to the capital.","\n","^\"Will you not bow down to your  king?\" the creature growls and you fall to the floor in fear. It's as if you felt the reverberation of his voice down to your very bones.","\n","^\"I asked to be presented with the most beautiful and worthy young people in the land. Your actions today have shown me you are neither beautiful nor worthy.\"","\n","^\"Instead, you are cruel, judgmental, and unfit to lead anyone as there is still very much a jealous and spiteful child within your heart.\"","\n","^\"You, along with all others who have been found unworthy, shall be kept here in the capital until a worthy heir is found. They will decide what to do with the likes of you.\"","\n","^You crumble to the floor, hopeless and dismayed. What will become of you now?","\n",{"->":"the_end.end_2"},{"#f":5}]}],{"#f":1}],"the_end":[{"->":".^.end_1"},{"end_1":["^And so it was that the kingdom rejoiced in the selection of their new queen. The people called her Pandora, an ode to her triumph over dark times and her role as the champion of the people's hope.","\n","end",{"#f":1}],"end_2":["^The king ultimately chose a young woman who, while not traditionally beautiful, was beautiful and worthy in her actions. She released all who had been held captive by the king and entrusted them with a solemn duty: to go out into the kingdom and teach the value of kindness, compassion, and good.","\n","^You became one of her most ardent supporters, determined to make your next voyage in the world one full of hope and wonder.","\n","end",{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}